  angular.module('app.controllers.reports.consumption', [])
  .controller('reportsConsumptionTrendsCtrl', [
        '$scope', '$rootScope', 'html2pdf', '$timeout', function($scope, $rootScope, html2pdf, $timeout) {

            $scope.chartOptions1 = {
                options: {
                    chart: {
                        type: 'column'
                    },
                    title: null,
                    xAxis: {
                        categories: [
                            'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun',
                            'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec'
                        ]
                    },
                    yAxis: {
                        title: {
                            text: '占总能耗%'
                        },
                        plotLines: [
                            {
                                value: 0,
                                width: 1,
                                color: '#808080'
                            }
                        ],
                        min: 0,
                        max: 100
                    },
                    tooltip: {
                        valueSuffix: '%'
                    },
                    legend: {
                        align: 'center',
                        verticalAlign: 'bottom',
                        borderWidth: 0
                    },
                    plotOptions: {
                        column: {
                            stacking: 'percent'
                            //dataLabels: {
                            //    enabled: true,
                            //    color: (Highcharts.theme && Highcharts.theme.dataLabelsColor) || 'white',
                            //    style: {
                            //        textShadow: '0 0 3px black'
                            //    }
                            //}
                        }
                    },
                    credits: {
                        enabled: false
                    }
                },
                series: [
                    {
                        name: '照明',
                        data: [15.16, 17.00, 17.46, 17.12, 19.29, 12.42, 13.22, 18.95, 16.95, 14.42, 15.71, 13.30]
                    }, {
                        name: '取暖',
                        data: [16.69, 17.47, 18.08, 17.95, 15.10, 22.96, 16.56, 15.98, 16.95, 16.41, 16.38, 17.43]
                    }, {
                        name: '制冷',
                        data: [16.69, 17.47, 18.58, 14.52, 17.64, 17.75, 15.56, 16.55, 17.29, 13.95, 16.05, 17.09]
                    }, {
                        name: '设备',
                        data: [17.86, 13.95, 17.71, 17.59, 17.77, 15.14, 16.89, 13.58, 16.15, 17.47, 13.90, 15.94]
                    }, {
                        name: '动力',
                        data: [14.10, 17.47, 15.34, 16.41, 15.10, 15.87, 18.89, 18.95, 16.15, 19.93, 18.76, 17.20]
                    }, {
                        name: '其他',
                        data: [19.51, 16.65, 12.84, 16.41, 15.10, 15.87, 18.89, 15.98, 16.50, 17.82, 19.21, 19.04]
                    }
                ]
            };

            $scope.chartOptions2 = {
                options: {
                    chart: {
                        type: 'area'
                    },
                    title: null,
                    xAxis: {
                        categories: [
                            '1', '2', '3', '4', '5', '6',
                            '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18',
                            '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30'
                        ]
                    },
                    yAxis: {
                        title: {
                            text: '占总能耗%'
                        },
                        plotLines: [
                            {
                                value: 0,
                                width: 1,
                                color: '#808080'
                            }
                        ],
                        min: 0,
                        max: 100
                    },
                    tooltip: {
                        valueSuffix: '%'
                    },
                    legend: {
                        align: 'center',
                        verticalAlign: 'bottom',
                        borderWidth: 0
                    },
                    plotOptions: {
                        area: {
                            stacking: 'percent',
                            lineWidth: 0,
                            marker: {
                                enabled: false
                            }
                        }
                    },
                    credits: {
                        enabled: false
                    }
                },
                series: [
                    {
                        name: '照明',
                        data: [19.20, 17.02, 17.41, 19.64, 17.90, 16.01, 15.64, 16.89, 18.87, 16.90, 16.55, 14.95, 17.48, 14.91, 16.56, 16.83, 16.86, 15.17, 17.83, 16.58, 20.16, 17.34, 18.63, 15.38, 19.69, 18.42, 20.49, 11.95, 13.06, 13.91, 12.29]
                    }, {
                        name: '取暖',
                        data: [17.20, 19.00, 19.92, 18.27, 16.02, 13.57, 16.62, 16.49, 14.51, 18.17, 18.50, 17.63, 17.91, 15.18, 16.43, 19.72, 19.48, 16.59, 15.60, 21.59, 17.64, 19.35, 21.31, 21.31, 18.77, 18.42, 17.05, 17.78, 15.07, 17.39, 17.20]
                    }, {
                        name: '制冷',
                        data: [14.90, 14.44, 16.57, 16.76, 14.80, 18.31, 17.46, 19.32, 17.55, 15.50, 16.55, 14.95, 17.05, 16.53, 14.72, 17.24, 18.33, 19.75, 19.92, 14.16, 15.28, 14.71, 14.75, 13.14, 14.92, 15.63, 17.05, 18.22, 19.25, 18.50, 18.28]
                    }, {
                        name: '设备',
                        data: [16.28, 18.09, 16.99, 15.11, 16.02, 19.46, 17.46, 15.14, 16.49, 18.17, 18.50, 17.21, 15.76, 17.07, 16.03, 14.21, 15.71, 20.22, 19.92, 14.16, 15.28, 14.71, 14.75, 15.87, 12.62, 15.95, 13.61, 17.35, 16.82, 19.89, 20.43]
                    }, {
                        name: '动力',
                        data: [17.20, 19.00, 15.60, 17.17, 19.25, 17.03, 17.46, 15.14, 16.49, 18.17, 16.55, 17.21, 15.76, 19.38, 17.48, 13.66, 13.42, 15.32, 13.23, 17.10, 12.91, 15.02, 14.16, 19.07, 18.77, 18.09, 17.91, 20.85, 17.90, 16.55, 12.60]
                    }, {
                        name: '其他',
                        data: [15.21, 12.46, 13.51, 13.05, 16.02, 15.62, 15.36, 17.03, 16.09, 13.09, 13.35, 18.05, 16.05, 16.94, 18.79, 18.34, 16.20, 12.95, 13.51, 16.41, 18.74, 18.89, 16.39, 15.22, 15.23, 13.49, 13.90, 13.85, 17.90, 13.77, 19.20]
                    }
                ]
            };

            $scope.export = function(){
                html2pdf.export($("#export-container"), 'Report.Consumption.Trends');
            }
        }
    ])